<?php
// Start the session
session_start();
//connection:
$hostname='localhost';
$username='root';
$passeword='';
$connect=mysql_connect($hostname,$username,$passeword);
//creation db AppSchicksal:
$create='create database if not exists AppRetraitPermisConduire character set utf8 collate utf8_unicode_ci';
mysql_query($create);
if(!$create){
die("<br><br>"."<b>failed to create AppRetraitPermisConduire: </b>".mysql_error()."<br><br>"."<b>error nombre: </b>".mysql_errno());
}
//else{echo "<p><b>correcte</b></p>";}
?>
<?php
mysql_select_db('AppRetraitPermisConduire') or die(mysql_error());
//creation de la table Admin:
mysql_set_charset('utf8');
$Table1='create table if not exists Admin (
    id int (1) UNSIGNED AUTO_INCREMENT PRIMARY KEY,
	login varchar (30) NOT NULL,
	pass varchar (225) NOT NULL
	)';
mysql_query($Table1);	
if(!$Table1){
die("<br><br>"."<p><b>failed to create table Admin: </b></p>".mysql_error()."<br><br>"."<p><b>error nombre: </b></p>".mysql_errno());}
//else{echo "<p><b>correcte table1</b></p>";}
$query3="SELECT * FROM `Admin`";
$result=mysql_query($query3);
$result2=mysql_num_rows($result);
if ($result2==0) {
//Admin:
$admin1=mysql_query( 
"INSERT INTO Admin(login, pass) 
          VALUES('ADMIN','d033e22ae348aeb5660fc2140aec35850c4da997')");
if(!$admin1){die("<br><br>"."<b>failed to insert agent: </b>".mysql_error()."<br><br>"."<b>error nombre: </b>".mysql_errno());}
//else{echo "<p><b>correcte 2</b></p>";}
		  }
//creation de la table PermisConduire(PC):
$Table2='create table if not exists PermisConduire(
    idPC int (5) UNSIGNED AUTO_INCREMENT PRIMARY KEY,
    numPermis varchar (20) NOT NULL,
	nom varchar (30) NOT NULL,
	prenom varchar (30) NOT NULL,
	dateNais varchar (30) NOT NULL,
	lieuNais varchar (30) NOT NULL,
	sexe varchar (8) NOT NULL, 
	adresse varchar (30) NOT NULL,
	commune varchar (30) NOT NULL,
	wilaya varchar(30) NOT NULL,
	groupeSanguin varchar (5) NOT NULL,
	dateDeDelivraison varchar (30) NOT NULL,
	categorie varchar (5) NOT NULL,
	numImpr int (10) NOT NULL,
	nbPV int (5) NOT NULL
	)';
mysql_query($Table2);
if(!$Table2){
die("<br><br>"."<p><b>failed to create table PermisConduire: </b></p>".mysql_error()."<br><br>"."<p><b>error nombre: </b></p>".mysql_errno());}
//else{echo "<p><b>correcte table2</b></p>";}

//creation de la table TypeInfraction:
$Table3='create table if not exists TypeInfraction(
    idType int (1) UNSIGNED AUTO_INCREMENT PRIMARY KEY,
	nomType varchar (30) NOT NULL,
	description varchar (100) NOT NULL
	)';
mysql_query($Table3);
if(!$Table3){
die("<br><br>"."<p><b>failed to create table TypeInfraction: </b></p>".mysql_error()."<br><br>"."<p><b>error nombre: </b></p>".mysql_errno());}
//else{echo "<p><b>correcte table3</b></p>";}


//creation de la table Infractions:
$Table4='create table if not exists Infractions(
    inf int (3) UNSIGNED AUTO_INCREMENT PRIMARY KEY,
    id INT (3) NOT NULL, 
    natureInfraction varchar (400) NOT NULL,
	nomType varchar (30) NOT NULL,
	idType INT (1) NOT NULL ,
	decretInfraction varchar (100) NOT NULL,
	punissableInfraction varchar (100) NOT NULL,
	observationInfraction varchar (100) NOT NULL,
	amendeInfraction varchar (100) NOT NULL,
	foreign key(nomType) references TypeInfraction(nomType)
	)';
mysql_query($Table4);
if(!$Table4){
die("<br><br>"."<p><b>failed to create table Infractions: </b></p>".mysql_error()."<br><br>"."<p><b>error nombre: </b></p>".mysql_errno());}
//else{echo "<p><b>correcte table4</b></p>";}

//creation de la table ProcesVerbal:
$Table5='create table if not exists ProcesVerbal(
    idPV int (5) UNSIGNED AUTO_INCREMENT PRIMARY KEY,
	provenanceDuPermis varchar (30) NOT NULL, 
	date varchar (30) NOT NULL,
	heure varchar (10) NOT NULL,
	numDeRoute varchar (30) NOT NULL,
	commune varchar (30) NOT NULL,
	wilaya varchar (30) NOT NULL,
	typeVehicule varchar (30) NOT NULL,
	matricule varchar (12) NOT NULL,
	amende int (5) NOT NULL,
	numPermis varchar (20) NOT NULL,
	sanctionner int (1) NOT NULL,
	foreign key(numPermis)references PermisConduire(numPermis)
	)';
mysql_query($Table5);
if(!$Table5){
die("<br><br>"."<p><b>failed to create table ProcesVerbal: </b></p>".mysql_error()."<br><br>"."<p><b>error nombre: </b></p>".mysql_errno());}
//else{echo "<p><b>correcte table5</b></p>";}

//creation de la table RelPVInf:
$Table6='create table if not exists RelPVInf(
    idPV int (5) NOT NULL,
	inf int (3) NOT NULL,
    PRIMARY KEY(idPV, inf),
	foreign key(idPV)references ProcesVerbal(idPV),
	foreign key(inf)references Infractions(inf)
	)';
mysql_query($Table6);
if(!$Table6){
die("<br><br>"."<p><b>failed to create table RelPVInf: </b></p>".mysql_error()."<br><br>"."<p><b>error nombre: </b></p>".mysql_errno());}
//else{echo "<p><b>correcte table6</b></p>";}

//creation de la table Sanction:
$Table7='create table if not exists Sanction(
	idSanction int (5)UNSIGNED AUTO_INCREMENT PRIMARY KEY,
	idPV int (5) NOT NULL,
	idCommission int (5) NOT NULL,
	idRecours int (5) NOT NULL,
	periode varchar (30) NOT NULL,
	dateFin varchar (30) NOT NULL,
	payement varchar (30) NOT NULL,
	foreign key(idPV)references ProcesVerbal(idPV),
    foreign key(idCommission)references Commission(idCommission),
	foreign key(idRecours)references Recours(idRecours)
	)';
mysql_query($Table7);
if(!$Table7){
die("<br><br>"."<p><b>failed to create table Sanction: </b></p>".mysql_error()."<br><br>"."<p><b>error nombre: </b></p>".mysql_errno());}
//else{echo "<p><b>correcte table7</b></p>";}


//creation de la table Recours:
$Table8='create table if not exists Recours(
	idRecours int (5)UNSIGNED AUTO_INCREMENT PRIMARY KEY,
	dateRecours varchar (30) NOT NULL,
	justification varchar (30) NOT NULL,
	idSanction int (5) NOT NULL,
	foreign key(idSanction)references Sanction(idSanction)
	)';
mysql_query($Table8);
if(!$Table8){
die("<br><br>"."<p><b>failed to create table Recours: </b></p>".mysql_error()."<br><br>"."<p><b>error nombre: </b></p>".mysql_errno());}
//else{echo "<p><b>correcte table8</b></p>";}

//creation de la table Commission:
$Table9='create table if not exists Commission(
    idCommission int (5) UNSIGNED AUTO_INCREMENT PRIMARY KEY,
	presidentCommission varchar (30) NOT NULL,
	rapporteur varchar (30) NOT NULL,
	representantTransport varchar (30) NOT NULL,
	representantAuto_ecole varchar (30) NOT NULL,
	representantenrgMine varchar (30) NOT NULL,
	representantPolice varchar (30) NOT NULL,
	representantGendarmerie varchar (30) NOT NULL,
	representantTravauxPublic varchar (30) NOT NULL,  
    dateCommission varchar (30) NOT NULL,
	heureCommission varchar (10) NOT NULL,
	lieuCommission varchar (30) NOT NULL
	)';
mysql_query($Table9);
if(!$Table9){
die("<br><br>"."<p><b>failed to create table Commission: </b></p>".mysql_error()."<br><br>"."<p><b>error nombre: </b></p>".mysql_errno());}
//else{echo "<p><b>correcte table9</b></p>";}
/////////////////////////////////////////////////////////////////////////////////////////////////////
$query7="SELECT * FROM `TypeInfraction`";
$result7=mysql_query($query7);
$result6=mysql_num_rows($result7);
if ($result6==0) {
$query=mysql_query( 
"INSERT INTO TypeInfraction(idType,nomType, description)
          VALUES
		  (1,'الدرجة الأولى', 'المخالفات التي تعاين بموجب غرامة جزافية'),
		  (2,'الدرجة الثانية', 'المخالفات التي تعاين بموجب غرامة جزافية'),
		  (3,'الدرجة الثالثة', 'المخالفات التي تعاين بموجب غرامة جزافية'),
		  (4,'الدرجة الرابعة', 'المخالفات التي تعاين بموجب غرامة جزافية'),
		  (5,'الجنح', 'الجنح التي تعاين بموجب محضر')
		  ");
		  mysql_set_charset('utf8');

if(!$query){die("<br><br>"."<b>failed to insert query: </b>".mysql_error()."<br><br>"."<b>error nombre: </b>".mysql_errno());}
//else{echo "<p><b>correcte $query</b></p>";}
		  }//fin if
/////////////////////////////////////المخالفات////////////////////////////////////////////////////////
$query4="SELECT * FROM `Infractions`";
$result4=mysql_query($query4);
$result5=mysql_num_rows($result4);
if ($result5==0) {
$inf1=mysql_query( 
"INSERT INTO Infractions (id ,idType,nomType, natureInfraction, decretInfraction, punissableInfraction, observationInfraction, amendeInfraction) 
          VALUES
		 ('1','1','الدرجة الأولى','مخالفة الأحكام المتعلقة بالإنارة و الإشارة و كبح الدراجات',  'المادة 66 / أ ـ 1 ق 01 ـ 14 م.م', 'المادة 66 / أ ق 01 ـ 14 م.م', 'الاحتفاظ  برخصة السياقة  نموذج  1', 'من 2000 د ج إلى 2500 د ج'),
	('2','1','الدرجة الأولى','مخالفة الأحكام المتعلقة بتقديم وثائق المركبة و كذا رخصة السياقة و / أو الشهادة المهنية التي ترخص بقيادة المركبة المعينة .',  'المادة 66 / أ ـ 2 ق 01 ـ 14 م.م', 'المادة 66 / أ ـ 2 ق 01 ـ 14 م.م', 'الاحتفاظ  برخصة السياقة  نموذج  1', 'من 2000 د ج إلى 2500 د ج'),
	('3','1','الدرجة الأولى','مخالفة الأحكام المتعلقة باستخدام آلة أو جهاز مركبة غير مطابق',  'المادة 66 / أ ـ 3 ق 01 ـ 14 م.م', 'المادة 66 / أ ق 01 ـ 14 م.م', 'الاحتفاظ  برخصة السياقة  نموذج  1', 'من 2000 د ج إلى 2500 د ج'),
	('4','1','الدرجة الأولى','مخالفة الراجلين للقواعد التي تنظم سيرهم ، لاسيما القواعد المتعلقة باستعمال الممرات المحمية',  'المادة 66 / أ ـ 4 ق 01 ـ 14 م.م', 'المادة 66 / أ ـ 2 ق 01 ـ 14 م.م', 'لاشـــــــيء', 'من 2000 د ج إلى 2500 د ج'),


('1','2','الدرجة الثانية','مخالفة الأحكام المتعلقة باستعمال أجهزة التنبيه الصوتي', 'المادة 66 / ب ـ 2 ق 01 ـ 14 م.م', 'المادة 66 / ب ق 01 ـ 14 م.م', 'الاحتفاظ  برخصة السياقة  نموذج  1', 'من 2000 د ج إلى 3000 د ج'),
('2','2','الدرجة الثانية','مخالفة الأحكام المتعلقة بالالتزام بتشغيل ضوء أو أضواء المركبة المجرورة بواسطة حيوانات', 'المادة 66 / ب ـ 3 ق 01 ـ 14 م.م', 'المادة 66 / ب ق 01 ـ 14 م.م', 'الاحتفاظ  برخصة السياقة  نموذج  1', 'من 2000 د ج إلى 3000 د ج'),
('3','2','الدرجة الثانية','مخالفة الأحكام المتعلقة بالمرور في أوساط الطريق أو المسالك أو الدروب أو أشرطة الطريق أو الأرصفة أو حواف الطرق المخصصة لمرور مركبات النقل الجماعي و غيرها من المركبات المرخص لها بذلك خصيصا ، ولمرور الراجلين', 'المادة 66 / ب ـ 4 ق 01 ـ 14 م.م', 'المادة 66 / ب ق 01 ـ 14 م.م', 'الاحتفاظ  برخصة السياقة  نموذج  1', 'من 2000 د ج إلى 3000 د ج'),
('4','2','الدرجة الثانية','مخالفة الأحكام المتعلقة بالتخفيض غير العادي للسرعة بدون أسباب حتمية، من شأنه تقليص سيولة حركة المرور', 'المادة 66 / ب ـ 5 ق 01 ـ 14 م.م', 'المادة 66 / ب ق 01 ـ 14 م.م', 'الاحتفاظ  برخصة السياقة  نموذج  1', 'من 2000 د ج إلى 3000 د ج'),
('5','2','الدرجة الثانية','مخالفة الأحكام المتعلقة بلوحات التسجيل و التجهيزات وإشارات النقل الاستثنائية وكذا مؤشرات السرعة', 'المادة 66 / ب ـ 6 ق 01 ـ 14 م.م', 'المادة 66 / ب ق 01 ـ 14 م.م', 'الاحتفاظ  برخصة السياقة  نموذج  1', 'من 2000 د ج إلى 3000 د ج'),
('6','2','الدرجة الثانية','مخالفة الأحكام المتعلقة بوضع الإشارة الملائمة من قبل كل سائق صاحب رخصة سياقة اختبارية', 'المادة 66 / ب ـ 7 ق 01 ـ 14 م.م', 'المادة 66 / ب ق 01 ـ 14 م.م', 'الاحتفاظ  برخصة السياقة  نموذج  1', 'من 2000 د ج إلى 3000 د ج'),
('7','2','الدرجة الثانية','مخالفة الأحكام المتعلقة بالسير على الخط المتواصل', 'المادة 66 / ب ـ 8 ق 01 ـ 14 م.م', 'المادة 66 / ب ق 01 ـ 14 م.م', 'الاحتفاظ  برخصة السياقة  نموذج  1', 'من 2000 د ج إلى 3000 د ج'),
('8','2','الدرجة الثانية','مخالفة الأحكام المتعلقة بسرعة المركبات ذات محرك ، بمقطورة أو بدون مقطورة أو نصف مقطورة ، في بعض مقاطع الطرق ولكل صنف من أصناف المركبات', 'المادة 66 / ج ـ 1 ق 01 ـ 14 م.م', 'المادة 66 / ج ق 01 ـ 14 م.م', 'سحب رخصة السياقة نموذج  3', 'من 2000 د ج إلى 4000 د ج'),


			('1','3','الدرجة الثالثة','مخالفة الأحكام المتعلقة بمنع المرور أو تقييده في بعض خطوط السير بالنسبة لبعض أصناف المركبات أو بالنسبة للمركبات التي تقوم ببعض أنواع النقل', 'المادة 66 / ج ـ 2 ق 01 ـ 14 م.م', 'المادة 66 / ج ق 01 ـ 14 م.م', 'سحب رخصة السياقة نموذج  3', 'من 2000 د ج إلى 4000 د ج'),
			('2','3','الدرجة الثالثة','مخالفة الأحكام المتعلقة بحالات الإلزام أو المنع المتعلقة بعبور السكك الحديدية الواقعة على الطريق', 'المادة 66 / ج ـ 3 ق 01 ـ 14 م.م', 'المادة 66 / ج ق 01 ـ 14 م.م', 'سحب رخصة السياقة نموذج  3', 'من 2000 د ج إلى 4000 د ج'),
			('3','3','الدرجة الثالثة','مخالفة الأحكام المتعلقة بوضع حزام الأمن', 'المادة 66 / ج ـ 4 ق 01 ـ 14 م.م', 'المادة 66 / ج ق 01 ـ 14 م.م', 'سحب رخصة السياقة نموذج  3', 'من 2000 د ج إلى 4000 د ج'),
			('4','3','الدرجة الثالثة','مخالفة الأحكام المتعلقة بالارتداء الإجباري للخوذة بالنسبة لسائقي الدراجات النارية و الدراجات المتحركة وراكبيها', 'المادة 66 / ج ـ 5 ق 01 ـ 14 م.م', 'المادة 66 / ج ق 01 ـ 14 م.م', 'سحب رخصة السياقة نموذج  3', 'من 2000 د ج إلى 4000 د ج'),
			('5','3','الدرجة الثالثة','مخالفة الأحكام المتعلقة بالارتداء الإجباري للخوذة بالنسبة لسائقي الدراجات النارية و الدراجات المتحركة وراكبيها', 'المادة 66 / ج ـ 5 ق 01 ـ 14 م.م', 'المادة 66 / ج ق 01 ـ 14 م.م', 'سحب رخصة السياقة نموذج  3', 'من 2000 د ج إلى 4000 د ج'),
			('6','3','الدرجة الثالثة','مخالفة الأحكام المتعلقة بالمرور أو التوقف أو الوقوف بدون ضرورة حتمية على شريط التوقف الاستعجالي للطريق السيار أو الطريق السريع', 'المادة 66 / ج ـ 6 ق 01 ـ 14 م.م', 'المادة 66 / ج ق 01 ـ 14 م.م', 'سحب رخصة السياقة نموذج  3', 'من 2000 د ج إلى 4000 د ج'),
		  ('7','3','الدرجة الثالثة','مخالفة الأحكام المتعلقة باستعمال أجهزة إنارة و إشارة المركبات المتحركة ذاتيا', 'المادة 66 / ج ـ 7 ق 01 ـ 14 م.م', 'المادة 66 / ج ق 01 ـ 14 م.م', 'سحب رخصة السياقة نموذج  3', 'من 2000 د ج إلى 4000 د ج'),
		  ('8','3','الدرجة الثالثة','مخالفة الأحكام المتعلقة بالاستعمال اليدوي للهاتف المحمول أو التصنت بكلتا الأذنين بوضع خوذة التصنت الإذاعي و السمعي أثناء السياقة', 'المادة 66 / ج ـ 8 ق 01 ـ 14 م.م', 'المادة 66 / ج ق 01 ـ 14 م.م', 'سحب رخصة السياقة نموذج  3', 'من 2000 د ج إلى 4000 د ج'),
		  ('9','3','الدرجة الثالثة','مخالفة الأحكام المتعلقة بتجاوز حدود السرعة المنصوص عليها بالنسبة لصنف السائقين الحائزين رخصة سياقة إختبارية', 'المادة 66 / ج ـ 9 ق 01 ـ 14 م.م', 'المادة 66 / ج ق 01 ـ 14 م.م', 'سحب رخصة السياقة نموذج  3', 'من 2000 د ج إلى 4000 د ج'),
		  ('10','3','الدرجة الثالثة','مخالفة الأحكام المتعلقة بأولوية مرور الراجلين على مستوى الممرات المحمية', 'المادة 66 / ج ـ 10 ق 01 ـ 14 م.م', 'المادة 66 / ج ق 01 ـ 14 م.م', 'سحب رخصة السياقة نموذج  3', 'من 2000 د ج إلى 4000 د ج'),
		  ('11','3','الدرجة الثالثة','مخالفة الأحكام المتعلقة بالتوقف أو الوقوف الخطيرين', 'المادة 66 / ج ـ 11 ق 01 ـ 14 م.م', 'المادة 66 / ج ق 01 ـ 14 م.م', 'الاحتفاظ  برخصة السياقة  نموذج  1', 'من 2000 د ج إلى 4000 د ج'),
		  ('12','3','الدرجة الثالثة','مخالفة الأحكام المتعلقة بالمسافة القانونية بين المركبات أثناء سيرها', 'المادة 66 / ج ـ 12 ق 01 ـ 14 م.م', 'المادة 66 / ج ق 01 ـ 14 م.م', 'الاحتفاظ  برخصة السياقة  نموذج  1', 'من 2000 د ج إلى 4000 د ج'),
		    ('13','3','الدرجة الثالثة','مخالفة الأحكام المتعلقة بمنع نقل الأطفال الذين تقل أعمارهم عن 10 سنوات في الأماكن الأمامية', 'المادة 66 / ج ـ 13 ق 01 ـ 14 م.م', 'المادة 66 / ج ق 01 ـ 14 م.م', 'الاحتفاظ  برخصة السياقة  نموذج  1', 'من 2000 د ج إلى 4000 د ج'),
		  ('14','3','الدرجة الثالثة','مخالفة الأحكام المتعلقة بالتوقف أو الوقوف التعسفي المعيق لحركة المرور', 'المادة 66 / ج ـ 14 ق 01 ـ 14 م.م', 'المادة 66 / ج ق 01 ـ 14 م.م', 'الاحتفاظ  برخصة السياقة  نموذج  1','من 2000 د ج إلى 4000 د ج'),
		  ('15','3','الدرجة الثالثة','مخالفة الأحكام المتعلقة باحترام قواعد السياقة السليمة', 'المادة 66 / ج ـ 15 ق 01 ـ 14 م.م', 'المادة 66 / ج ق 01 ـ 14 م.م','الاحتفاظ  برخصة السياقة  نموذج  1', 'من 2000 د ج إلى 4000 د ج'),
		  ('16','3','الدرجة الثالثة','مخالفة الأحكام المتعلقة بالأضرار الملحقة بالمسالك العمومية أو بملحقاتها', 'المادة 66 / ج ـ 16 ق 01 ـ 14 م.م', 'المادة 66 / ج ق 01 ـ 14 م.م', 'الاحتفاظ  برخصة السياقة  نموذج  1', 'من 2000 د ج إلى 4000 د ج'),
		   ('17','3','الدرجة الثالثة','مخالفة الأحكام المتعلقة بمرور مركبة ذات محرك أو مقطورة في المسالك المفتوحة لحركة المرور دون أن تكون هذه المركبة مزودة بلوحتي التسجيل', 'المادة 66 / ج ـ 17 ق 01 ـ 14 م.م', 'المادة 66 / ج ق 01 ـ 14 م.م', 'الاحتفاظ  برخصة السياقة  نموذج  1', 'من 2000 د ج إلى 4000 د ج'),
		  ('18','3','الدرجة الثالثة','مخالفة الأحكام المتعلقة بتصاعد الأدخنة و الغازات السامة وصدور الضجيج عند تجاوز المستويات المحددة', 'المادة 66 / ج ـ 18 ق 01 ـ 14 م.م', 'المادة 66 / ج ق 01 ـ 14 م.م', 'الاحتفاظ  برخصة السياقة  نموذج  1', 'من 2000 د ج إلى 4000 د ج'),
		  ('19','3','الدرجة الثالثة','مخالفة الأحكام المتعلقة بالمركبات غير المزودة بالتجهيزات التي تسمح للسائق بأن يكون له مجال رؤية كاف', 'المادة 66 / ج ـ 19 ق 01 ـ 14 م.م', 'المادة 66 / ج ق 01 ـ 14 م.م', 'الاحتفاظ  برخصة السياقة  نموذج  1', 'من 2000 د ج إلى 4000 د ج'),
		  ('20','3','الدرجة الثالثة','مخالفة الأحكام المتعلقة بوضع شريط بلاستيكي أو أية مادة معتمة أخرى على زجاج المركبة', 'المادة 66 / ج ـ 20 ق 01 ـ 14 م.م', 'المادة 66 / ج ق 01 ـ 14 م.م', 'الاحتفاظ  برخصة السياقة  نموذج  1', 'من 2000 د ج إلى 4000 د ج'),
		  ('21','3','الدرجة الثالثة','مخالفة الأحكام المتعلقة بعدم التصريح بنقل ملكية المركبة أو عدم التصريح بتغيير إقامة مالك المركبة', 'المادة 66 / ج ـ 21 ق 01 ـ 14 م.م', 'المادة 66 / ج ق 01 ـ 14 م.م', 'الاحتفاظ  برخصة السياقة  نموذج  1', 'من 2000 د ج إلى 4000 د ج'),
		  ('22','3','الدرجة الثالثة','مخالفة الأحكام المتعلقة بعد التصريح بالتغييرات التي أجريت على المركبة', 'المادة 66 / ج ـ 22 ق 01 ـ 14 م.م', 'المادة 66 / ج ق 01 ـ 14 م.م', 'الاحتفاظ  برخصة السياقة  نموذج  1', 'من 2000 د ج إلى 4000 د ج'),
		 
         
         ('1','4','الدرجة الرابعة','مخالفة الأحكام المتعلقة باتجاه المرور المفروض', 'المادة 66 / د ـ 1 ق 09 ـ 03', 'المادة 66 / د ق 09 ـ 03', 'سحب رخصة السياقة نموذج  3', 'من 4000 د ج إلى 6000 د ج'),
		  ('2','4','الدرجة الرابعة','مخالفة الأحكام المتعلقة بتقاطع الطرقات و أولوية المرور', 'المادة 66 / د ـ 2 ق 09 ـ 03', 'المادة 66 / د ق 09 ـ 03', 'سحب رخصة السياقة نموذج  3', 'من 4000 د ج إلى 6000 د ج'),
		  ('3','4','الدرجة الرابعة','مخالفة الأحكام المتعلقة بالتقاطع و التجاوز', 'المادة 66 / د ـ 3 ق 09 ـ 03', 'المادة 66 / د ق 09 ـ 03', 'سحب رخصة السياقة نموذج  3', 'من 4000 د ج إلى 6000 د ج'),
		  ('4','4','الدرجة الرابعة','مخالفة الأحكام المتعلقة بإشارات الأمر بالتوقف التام', 'المادة 66 / د ـ 4 ق 09 ـ 03', 'المادة 66 / د ق 09 ـ 03', 'سحب رخصة السياقة نموذج  3', 'من 4000 د ج إلى 6000 د ج'),
		  ('5','4','الدرجة الرابعة','مخالفة الأحكام المتعلقة بالمناورات الممنوعة في الطرق السيارة و الطرق السريعة', 'المادة 66 / د ـ 5 ق 09 ـ 03', 'المادة 66 / د ق 09 ـ 03', 'سحب رخصة السياقة نموذج  3', 'من 4000 د ج إلى 6000 د ج'),
		  ('6','4','الدرجة الرابعة','مخالفة الأحكام المتعلقة بزيادة السرعة من طرف سائق المركبة أثناء محاولة تجاوزه من طرف سائق آخر', 'المادة 66 / د ـ 6 ق 09 ـ 03', 'المادة 66 / د ق 09 ـ 03', 'سحب رخصة السياقة نموذج  3', 'من 4000 د ج إلى 6000 د ج'),
		  ('7','4','الدرجة الرابعة','مخالفة الأحكام المتعلقة بسير مركبة بدون إنارة أو إشارة أو وقوفها في وسط الطريق ليلا أو أثناء انتشار الضباب في مكان خال من الإنارة العمومية', 'المادة 66 / د ـ 7 ق 09 ـ 03', 'المادة 66 / د ق 09 ـ 03', 'سحب رخصة السياقة نموذج  3', 'من 4000 د ج إلى 6000 د ج'),
		  ('8','4','الدرجة الرابعة','مخالفة الأحكام المتعلقة بمنع المرور على مسلك يقع مباشرة على يسار طريق يتضمن ثلاثة مسالك  أو أكثر ذات اتجاه واحد للمرور بالنسبة لمركبات نقل الأشخاص أو البضائع التي يتجاوز طولها 7 أمتر ، أو ذات وزن إجمالي مرخص به مع الحمولة يفوق طنين 2', 'المادة 66 / د ـ 8 ق 09 ـ 03', 'المادة 66 / د ق 09 ـ 03', 'سحب رخصة السياقة نموذج  3', 'من 4000 د ج إلى 6000 د ج'),
		  ('9','4','الدرجة الرابعة','مخالفة الأحكام المتعلقة بالوقوف أو التوقف على أجزاء الطريق التي تعبر سطحها سكة حديدية أو سير مركبات غير مرخص لها ب\لك على الخطوط الحديدية', 'المادة 66 / د ـ 9 ق 09 ـ 03', 'المادة 66 / د ق 09 ـ 03', 'سحب رخصة السياقة نموذج  3', 'من 4000 د ج إلى 6000 د ج'),
		  ('10','4','الدرجة الرابعة','مخالفة الأحكام المتعلقة بعبور بعض مقاطع الطرق الممنوعة للسير أو بعض الجسور ذات الحمولة المحدودة', 'المادة 66 / د ـ 10 ق 09 ـ 03', 'المادة 66 / د ق 09 ـ 03', 'سحب رخصة السياقة نموذج  3', 'من 4000 د ج إلى 6000 د ج'),
		  ('11','4','الدرجة الرابعة','مخالفة الأحكام المتعلقة بوزن المركبات وطبيعة الأطر المطاطية للمركبات ذات محرك غير المطابقة للمعايير المقبولة و شكلها و حالتها', 'المادة 66 / د ـ 11 ق 09 ـ 03', 'المادة 66 / د ق 09 ـ 03', 'سحب رخصة السياقة نموذج  3', 'من 4000 د ج إلى 6000 د ج'),
		  ('12','4','الدرجة الرابعة','مخالفة الأحكام المتعلقة بمكابح المركبات ذات محرك و ربط المقطورات و نصف المقطورات', 'المادة 66 / د ـ 12 ق 09 ـ 03', 'المادة 66 / د ق 09 ـ 03', 'سحب رخصة السياقة نموذج  3', 'من 4000 د ج إلى 6000 د ج'),
		  ('13','4','الدرجة الرابعة','مخالفة الأحكام المتعلقة بالحمولة القصوى لكل محور', 'المادة 66 / د ـ 13 ق 09 ـ 03', 'المادة 66 / د ق 09 ـ 03', 'سحب رخصة السياقة نموذج  3', 'من 4000 د ج إلى 6000 د ج'),
		  ('14','4','الدرجة الرابعة','مخالفة الأحكام المتعلقة بترتيب جهاز تسجيل السرعة بالمقيت وخصوصياته وتشغيله وصيانته', 'المادة 66 / د ـ 14 ق 09 ـ 03', 'المادة 66 / د ق 09 ـ 03', 'سحب رخصة السياقة نموذج  3', 'من 4000 د ج إلى 6000 د ج'),
		  ('15','4','الدرجة الرابعة','مخالفة الأحكام المتعلقة بالتغيير الهام للاتجاه دون تأكد السائق من أن المناورة لا تشكل خطرا على المستعملين الآخرين ودون تنبيههم برغبته في تغيير الإتجاه', 'المادة 66 / د ـ 15 ق 09 ـ 03', 'المادة 66 / د ق 09 ـ 03', 'سحب رخصة السياقة نموذج  3', 'من 4000 د ج إلى 6000 د ج'),
		  ('16','4','الدرجة الرابعة','مخالفة الأحكام المتعلقة باجتياز خط متواصل', 'المادة 66 / د ـ 16 ق 09 ـ 03', 'المادة 66 / د ق 09 ـ 03', 'سحب رخصة السياقة نموذج  3', 'من 4000 د ج إلى 6000 د ج'),
		  ('17','4','الدرجة الرابعة','مخالفة الأحكام المتعلقة بتشغيل الأجهزة السمعية البصرية في مقدمة المركبة أثناء السياقة', 'المادة 66 / د ـ 17 ق 09 ـ 03', 'المادة 66 / د ق 09 ـ 03', 'سحب رخصة السياقة نموذج  3', 'من 4000 د ج إلى 6000 د ج'),
		  ('18','4','الدرجة الرابعة','مخالفة الأحكام المتعلقة بالمكوث على الشريط الوسطي الذي يفصل أوساط الطرق في الطريق السيار و الطريق السريع', 'المادة 66 / د ـ 18 ق 09 ـ 03', 'المادة 66 / د ق 09 ـ 03', 'الاحتفاظ  برخصة السياقة  نموذج  1', 'من 4000 د ج إلى 6000 د ج'),
		  ('19','4','الدرجة الرابعة','مخالفة الأحكام المتعلقة بعدم مطابقة القواعد الخاصة بتنظيم السباقات على المسالك العمومية', 'المادة 66 / د ـ 19 ق 09 ـ 03', 'المادة 66 / د ق 09 ـ 03', 'الاحتفاظ  برخصة السياقة  نموذج  1', 'من 4000 د ج إلى 6000 د ج'),
		  ('20','4','الدرجة الرابعة','مخالفة الأحكام المتعلقة بحجم المركبات وتركيب أجهزة إنارة و إشارة المركبات', 'المادة 66 / د ـ 20 ق 09 ـ 03', 'المادة 66 / د ق 09 ـ 03', 'الاحتفاظ  برخصة السياقة  نموذج  1', 'من 4000 د ج إلى 6000 د ج'),
		  ('21','4','الدرجة الرابعة','مخالفة الأحكام المتعلقة بالاستمرار في مركبة دون إجراء الفحص الطبي الدوري', 'المادة 66 / د ـ 21 ق 09 ـ 03', 'المادة 66 / د ق 09 ـ 03', 'الاحتفاظ  برخصة السياقة  نموذج  1', 'من 4000 د ج إلى 6000 د ج'),
		  ('22','4','الدرجة الرابعة','مخالفة الأحكام المتعلقة بتعليم سياقة المركبات ذات محرك بمقابل أو بدون مقابل', 'المادة 66 / د ـ 22 ق 09 ـ 03', 'المادة 66 / د ق 09 ـ 03', 'الاحتفاظ  برخصة السياقة  نموذج  1', 'من 4000 د ج إلى 6000 د ج'),
		
			('1','5','الجنح','إرتكاب جريمة القتل الخطأ و/أو الجرح الخطأ نتيجة خطأ منه أو تهاونه أو تغافله أو عدم امتثاله لقواعد حركة المرور في الطرق', 'المادة 67 ق 01 – 14 م.م', 'المادتين 288 و 289 من ق.ع','8', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('2','5','الجنح','إرتكاب جريمة القتل الخطأ و هو في حالة سكر أو تحت تأثير مواد أو أعشاب تدخل ضمن أصناف اﻟﻤﺨذرات', 'المادة 68 / 1 ق 01 – 14 م.م', 'المادة 68 / 1 ق 01 – 14 م.م', ' ', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('3','5','الجنح','إرتكاب الجنحة المذكورة في الخانة رقم 02 بواسطة مركبة تابعة لأصناف الوزن الثقيل أو النقل الجماعي أو نقل الموادالخطيرة', 'المادة 68 / 2 ق 01 – 14 م.م', 'المادة 68 / 2 ق 01 – 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('4','5','الجنح','إرتكاب جريمة القتل الخطأ بسبب مخالفة الإفراط في السرعة', 'المادة 69 / 1- 1 ق 01- 14 م.م', 'المادة 69 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('5','5','الجنح','إرتكاب جريمة القتل الخطأ بسبب التجاوز الخطير', 'المادة 69 / 1- 2 ق 01- 14 م.م', 'المادة 69 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('6','5','الجنح','إرتكاب جريمة القتل الخطأ بسبب عدم احترام الأولوية القانونية', 'المادة 69 / 1- 3 ق 01- 14 م.م', 'المادة 69 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('7','5','الجنح','إرتكاب جريمة القتل الخطأ بسبب عدم الامتثال لإشارات الأمر بالتوقف التام', 'المادة 69 / 1- 4 ق 01- 14 م.م', 'المادة 69 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('8','5','الجنح','إرتكاب جريمة القتل الخطأ بسبب المناورات الخطيرة', 'المادة 69 / 1- 5 ق 01- 14 م.م', 'المادة 69 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('9','5','الجنح','إرتكاب جريمة القتل الخطأ بسبب السير في الإتجاه الممنوع', 'المادة 69 / 1- 6 ق 01- 14 م.م', 'المادة 69 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('10','5','الجنح','إرتكاب جريمة القتل الخطأ بسبب سير مركبة بدون إنارة أو إشارة أو وقوفها في وسط الطريق ليلا أو أثناء انتشار الضباب في مكان خال من الإنارة العمومية', 'المادة 69 / 1- 7 ق 01- 14 م.م', 'المادة 69 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('11','5','الجنح','إرتكاب جريمة القتل الخطأ بسبب الإستعمال اليدوي للهاتف المحمول أو التصنت بكلتا الأذنين بوضع خوذة التصنت الإذاعي و السمعي أثناء السياقة', 'المادة 69 / 1- 8 ق 01- 14 م.م', 'المادة 69 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('12','5','الجنح','إرتكاب جريمة القتل الخطأ بسبب تشغيل الأجهزة السمعية البصرية أثناء السياقة', 'المادة 69 / 1- 9 ق 01- 14 م.م', 'المادة 69 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('13','5','الجنح','إرتكاب جريمة القتل الخطأ بسبب إحدى المخالفات المذكورة في الخانات من 04 إلى 12 بواسطة مركبة تابعة لأصناف الوزن الثقيل أو النقل الجماعي أو نقل المواد الخطيرة', 'المادة 69 / 2 ق 01- 14 م.م', 'المادة 69 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('14','5','الجنح','إرتكاب السائق جنحة الجرح الخطأ بسبب المخالفة المذكورة في الخانة 2', 'المادة 70 / 1 ق 01- 14 م.م', 'المادة 70 / 1 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('15','5','الجنح','إرتكاب السائق جنحة الجرح الخطأ المذكورة في الخانة 14 بواسطة مركبة تابعة لأصناف الوزن الثقيل أو النقل الجماعي أو نقل المواد الخطيرة', 'المادة 70 / 2 ق 01- 14 م.م', 'المادة 70 / 2 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('16','5','الجنح','إرتكاب جريمة الجرح الخطأ بسبب إحدى المخالفات المسبوق ذكرها في الخانات من 04 إلى 12', 'المادة 71 / 1 ق 01- 14 م.م', 'المادة 71 / 1 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('17','5','الجنح','إرتكاب جريمة الجرح الخطأ بسبب إحدى المخالفات المذكورة في الخانات من 04 إلى 12 بواسطة مركبة تابعة لأصناف الوزن الثقيل أو النقل الجماعي أو نقل المواد الخطيرة', 'المادة 71 / 2 ق 01- 14 م.م', 'المادة 71 / 2 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('18','5','الجنح','إرتكاب جنحة عدم توقف السائق رغم علمه بأنه قد ارتكب حادث أو تسبب في وقوعه بواسطة المركبة التي يقودها وحاول اللإلات من المسؤولية الجزائية أو المدنية التي قد يتعرض لها', 'المادة 72 ق 01- 14 م.م', 'المادة 72 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('19','5','الجنح','إرتكاب السائق جريمة القتل الخطأ بسبب المخالفة التي سبق ذكرها في الخانة 18', 'المادة 73 / 1 ق 01- 14 م.م', 'المادة 73 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('20','5','الجنح','إرتكاب السائق جنحة القتل الجرح الخطأ بسبب المخالفة التي سبق ذكرها في الخانة 18', 'المادة 67 ق 01 – 14 م.م', 'المادتين 288 و 289 من ق.ع','', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('21','5','الجنح','قيادة مركبة أو مرافقة السائق المتدرب في إطار التمهين بدون مقابل أو بمقابل مثلما هو محدد في هذا القانون وهو في حالة سكر', 'المادة 68 / 1 ق 01 – 14 م.م', 'المادة 68 / 1 ق 01 – 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('22','5','الجنح','قيادة مركبة تحت تأثير مواد أو أعشاب تدخل ضمن أصناف المخدرات', 'المادة 68 / 2 ق 01 – 14 م.م', 'المادة 68 / 2 ق 01 – 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('23','5','الجنح','رفض السائق أو المرافق لسائق متدرب الخضوع للفحوص الطبية و الإستشفائية و البيولوجية المنصوص عليها في م 19 من ق 01-14', 'المادة 69 / 1- 1 ق 01- 14 م.م', 'المادة 69 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('24','5','الجنح','رفض السائق الإمتثال لإنذار التوقف الصادر عن الأعوان المنصوص عليهم في المادتين 130 و 131 من هذا القانون والحاملين للشارات الخارجية الظاهرة و الدالة على صفتهم ، أو يرفض الخضوع لكل التحقيقات المنصوص عليها في هذا القانون والمتعلقة بالمركبة أو الشخص', 'المادة 69 / 1- 2 ق 01- 14 م.م', 'المادة 69 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('25','5','الجنح','وضع للسير مركبة ذات محرك أو مقطورة مزودة بلوحة تسجيل أو تحمل كتابة لا تتطابق مع المركبة أو مع مستعملها', 'المادة 69 / 1- 3 ق 01- 14 م.م', 'المادة 69 ق 01- 14 م.م', 'يمكن الحكم بمصادرة المركبة', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('26','5','الجنح','حصول شخص على رخصة السياقة أو محاولة الحصول عليها أو على نسخة ثانية منها بواسطة تصريح كاذب', 'المادة 69 / 1- 4 ق 01- 14 م.م', 'المادة 69 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('27','5','الجنح','قيادة شخص مركبة دون الحيازة على رخصة سياقة صالحة بالنسبة لصنف المركبة المعنية', 'المادة 69 / 1- 5 ق 01- 14 م.م', 'المادة 69 ق 01- 14 م.م', 'يمنع لمدة سنة من الترشح للحصول على رخصة السياقة للأصناف الأخرى', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('28','5','الجنح','قيادة مركبة دون الحصول على رخصة سياقة', 'المادة 69 / 1- 6 ق 01- 14 م.م', 'المادة 69 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('29','5','الجنح','استمرار الشخص رغم تبليغه بواسطة الطرق القانونية بالقرار الصادر بشأنه و المتضمن تعليق أو إلغاء رخصة السياقة أو منع إستصدار رخصة سياقة جديدة في قيادة مركبة يقضي لأجل قيادتها مثل هذه الوثيقة', 'المادة 69 / 1- 7 ق 01- 14 م.م', 'المادة 69 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('30','5','الجنح','استلام الشخص تبليغ قرار صادر بشأنه يتضمن تعليق أو إلغاء رخصة السياقة أو رفض رد الرخصة المعلقة أو الملغاة إلى العون التابع للسلطة المكلفة بتنفيذ هذا القرار', 'المادة 69 / 1- 8 ق 01- 14 م.م', 'المادة 69 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('31','5','الجنح','وضع ممهلات على مسلك مفتوح لحركة المرور بدون ترخيص', 'المادة 69 / 1- 9 ق 01- 14 م.م', 'المادة 69 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('32','5','الجنح','عدم إخضاع المركبة للمراقبة التقنية الدورية الإجبارية', 'المادة 69 / 2 ق 01- 14 م.م', 'المادة 69 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('33','5','الجنح','حيازة أو استعمال بأي صفة كانت جهاز  أو آلة تخصص إما للكشف عن وجود أدوات تستخدم لمعاينة المخالفات للتشريع  و التنظيم المتعلقة بحركة المرور أو عرقلة تشغيلها', 'المادة 70 / 1 ق 01- 14 م.م', 'المادة 70 / 1 ق 01- 14 م.م', 'تتم مصادرة هذا الجهاز أو هذه الآلة', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('34','5','الجنح','مخالفة الأحكام الخاصة بالمركبات المعدة لنقل الحاويات والمتعلقة بـ:ــ وجوب تجهيزها بنظام ترسيخ قطع الزاوية المصادق عليه من قبل المصالح المعنية.ــ منع تثبت الحاويات بواسطة الأسلاك أو أحزمة أو أية وسائل أخرى', 'المادة 70 / 2 ق 01- 14 م.م', 'المادة 70 / 2 ق 01- 14 م.م', 'عدم الإخلال بالتوقيف الفوري للمركبة و العقوبات الإدارية المنصوص عليها في هذا القانون', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('35','5','الجنح','مخالفة الأحكام التي تنظم النقل الخاضع للرخصة', 'المادة 71 / 1 ق 01- 14 م.م', 'المادة 71 / 1 ق 01- 14 م.م', 'عدم الإخلال بالتوقيف الفوري للمركبة و العقوبات الإدارية المنصوص عليها في هذا القانون', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('36','5','الجنح','تنظيم سباقات العدو أو سباقات المركبات ذات محرك أو سباقات الدراجات النارية على المسلك العمومي بدون ترخيص من السلطة المختصة', 'المادة 71 / 2 ق 01- 14 م.م', 'المادة 71 / 2 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('37','5','الجنح','عدم رد في الآجال المقررة ، البطاقة الرمادية للمركبة بعد السحب النهائي للمركبة المذكورة من السير طبقا لأحكام م52 مكرر من هذا القانون', 'المادة 72 ق 01- 14 م.م', 'المادة 72 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('38','5','الجنح','تجاوز السرعة القانونية المرخص بها التي قامت التجهيزات المعتمدة بمعاينتها في الطريق السيار بـ 40 كلم/سا', 'المادة 73 / 1 ق 01- 14 م.م', 'المادة 73 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('39','5','الجنح','تجاوز السرعة القانونية المرخص بها التي قامت التجهيزات المعتمدة بمعاينتها في الطريق و خارج التجمعات السكانية بـ 30 كلم/سا', 'المادة 69 / 1- 7 ق 01- 14 م.م', 'المادة 69 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('40','5','الجنح','تجاوز السرعة القانونية المرخص بها التي قامت التجهيزات المعتمدة بمعاينتها في الطريق و داخل التجمعات السكانية بـ 20 كلم/سا', 'المادة 69 / 1- 8 ق 01- 14 م.م', 'المادة 69 ق 01- 14 م.م', '', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف'),
		  ('41','5','الجنح','القيام بأشغال على رحاب الطريق بدون ترخيص', 'المادة 69 / 1- 9 ق 01- 14 م.م', 'المادة 69 ق 01- 14 م.م', ' ', 'الأصلية + نسخة: وكيل الجمهورية الثانية : الوالي ،الثالثة : الأرشيف')
		  
			 ");
		  mysql_set_charset('utf8');                               

if(!$inf1){die("<br><br>"."<b>failed to insert inf1: </b>".mysql_error()."<br><br>"."<b>error nombre: </b>".mysql_errno());}
//else{echo "<p><b>correcte inf2</b></p>";}
		   }//fin if
		   
/////  des permis de conduires pour les testes  


$query7="SELECT * FROM `PermisConduire`";
$result7=mysql_query($query7);
$result6=mysql_num_rows($result7);
if ($result6==0) {
$query=mysql_query( 
"INSERT INTO PermisConduire (`numPermis`, `nom`, `prenom`, `dateNais`, `lieuNais`, `sexe`, `adresse`, `commune`, `wilaya`, `groupeSanguin`, `dateDeDelivraison`, `categorie`, `numImpr`, `nbPV`)
		 VALUES
 ('13/52431/06.24'  , 'Ouchtati', 'AbouBakr Adil', '1995-02-13', 'Guelma', 'homme ', 'cite Sonacome bt 4 n°8 guelma ', 'guelma', 'guelma', 'O+', '2015-07-26', 'B', '1758485', '1'),
 ('12/29478/06.24'  , 'Ayadi ', 'Nedjib', '1994-04-124', 'Guelma', 'homme ', 'olivier bt 2 n°4 ', 'guelma', 'guelma', 'O+', '2013-07-05', 'B', '1999485', '0'),
 ('10/11456/06.24'  , 'Ouchtati', 'Abd Raouf', '2000-12-19', 'Guelma', 'homme ', 'cite Sonacome bt 4 n°8 guelma ', 'guelma', 'guelma', 'O+', '2013-07-05', 'B', '1733385', '0'),
 ('13/24242/06.24'  , 'BenKkirat', 'Wafa', '1995-04-04', 'Guelma', 'femme ', 'cite 19 juin N°118 ', 'guelma', 'guelma', 'O+', '2013-07-05', 'B', '17577785', '0'),
 ('13/12456/06.24', 'Bourahdoun', 'Mohammed Ilyes', '1994-07-17', 'Guelma', 'homme ', 'cite Sonacome bt 4 n°8 guelma ', 'guelma', 'guelma', 'O-', '2013-07-05', 'B', '17588885', '0'),
 ('13/05558/06.24'  , 'Sellmi', 'Ahmed', '1990-06-27', 'Guelma', 'homme ', 'cite 19 juin N°200 ', 'guelma', 'guelma', 'O-', '2013-07-05', 'B', '1758485', '0'),
 ('13/12589/06.24'  , 'Chghayéb', 'Nour Eddine', '1985-02-05', 'Guelma', 'homme ', 'cite khala bt 4 n 8 ', 'guelma', 'guelma', 'O+', '2013-07-05', 'B', '1757415', '1'),
 ('13/78963/06.24'  , 'Chéyb', 'Badri', '1987-06-24', 'Guelma', 'homme ', 'cite khala bt 7 n 22 ', 'guelma', 'guelma', 'AB+', '2013-07-05', 'B', '17584852', '0'),
 ('13/59985/06.24'  , 'Merdjani', 'Karim', '1990-07-14', 'Guelma', 'homme ', 'cite Gahdour bt 22 n 9 ', 'guelma', 'guelma', 'O-', '2013-07-05', 'B', '1758963', '1'),
 ('13/12533/06.24'  , 'Merad', 'Maya', '1995-10-02', 'Guelma', 'femme ', 'cite Gahdour bt 22 n 10 ', 'guelma', 'guelma', 'B-', '2013-07-05', 'B', '1758123', '0'),
 ('13/15987/06.24'  , 'Mehallag', 'Imad', '1989-08-22', 'Guelma', 'homme ', 'cite Gahdour bt 23 n 17 ', 'guelma', 'guelma', 'A+', '2013-07-05', 'B', '1123485', '0'),
 ('13/35789/06.24'  , 'Ouchtati', 'Manel', '1999-02-15', 'Guelma', 'femme ', 'cite 19 juin n° 157 ', 'guelma', 'guelma', 'A-', '2013-07-05', 'B', '1755915', '0'),
 ('08/22236/06.24'  , 'Touahri', 'Islem', '1988-07-07', 'Guelma', 'homme ', 'cite 19 juin n° 222 ', 'guelma', 'guelma', 'A+', '2013-07-05', 'B', '1353773', '0'),
 ('10/11125/06.24'  , 'Aouaitia', 'Asma', '1995-07-08', 'Tebessa', 'femme ', 'hamamt ', 'guelma', 'guelma', 'AB+', '2013-07-05', 'B', '1758493', '0'),
 ('13/77789/06.24'  , 'Aouaitia', 'Hamza', '1993-10-19', 'Tebessa', 'homme ', 'hamamt ', 'guelma', 'guelma', 'AB+', '2013-07-05', 'B', '128487', '1'),
 ('15/77899/06.24'  , 'Aouaitia', 'Islem', '1998-08-24', 'Tebessa', 'homme ', 'hamamt ', 'guelma', 'guelma', 'AB+', '2013-07-05', 'B', '1258481', '1'),
 ('15/12225/06.24'  , 'Aouaitia', 'Bouthaina', '1992-02-09', 'Tebessa', 'femme ', 'hamamt ', 'guelma', 'guelma', 'AB+', '2013-07-05', 'B', '1758493', '0'),
 ('13/71234/06.24'  , 'Toubi', 'Wissem', '1995-02-15', 'annaba', 'femme ', '8 mars bt 4 n 2', 'guelma', 'guelma', 'O+', '2013-07-05', 'B', '1958481', '0'),
 ('13/78889/06.24'  , 'Hami', 'Abida', '1993-03-27', 'guelma', 'femme ', 'cite 19 juin ', 'guelma', 'guelma', 'o+', '2010-10-10', 'B', '2358987', '0'),
 ('13/69235/06.24'  , 'Mdjélkh', 'Amine', '1993-03-27', 'annaba', 'homme ', 'bordjiba n°44 ', 'guelma', 'guelma', 'AB+', '2010-10-10', 'B', '2358987', '0'),
 ('13/68235/06.24'  , 'Nesséibiya', 'amjed', '1993-03-27', 'annaba', 'homme ', 'cite 19 juin ', 'guelma', 'guelma', 'AB+', '2010-10-10', 'B', '2358987', '0'),
 ('18/66235/06.24'  , 'Socha', 'louisa', '1993-03-27', 'annaba', 'femme ', 'cite 19 juin ', 'guelma', 'guelma', 'AB+', '2010-10-10', 'B', '2358987', '0'),
 ('16/24235/06.24'  , 'Ben tbola', 'marwa', '1993-03-27', 'annaba', 'femme ', 'cite 19 juin ', 'guelma', 'guelma', 'AB+', '2010-10-10', 'B', '2358987', '0'),
 ('17/27235/06.24'  , 'Sliman', 'Hocine', '1993-03-27', 'annaba', 'homme ', 'cite 19 juin', 'guelma', 'guelma', 'AB+', '2010-10-10', 'B', '2358987', '0'),
 ('17/02235/06.24', 'Rhamnia', 'Anis', '1993-03-27', 'annaba', 'homme ', 'cite 19 juin', 'guelma', 'guelma', 'AB+', '2010-10-10', 'B', '2358987', '0'),
 ('15/96235/06.24' , 'nesseibia', 'Yamina', '1993-03-27', 'annaba', 'femme ', 'cite 19 juin ', 'guelma', 'guelma', 'AB+', '2010-10-10', 'B', '2358987', '0'),
 ('12/73235/06.24'  , 'Asia', 'Ghadjati', '1993-03-27', 'annaba', 'femme ', 'bordjiba n°44 ', 'guelma', 'guelma', 'AB+', '2010-10-10', 'B', '2358987', '0')
		  ");		  
		  mysql_set_charset('utf8');
if(!$query){die("<br><br>"."<b>failed to insert query: </b>".mysql_error()."<br><br>"."<b>error nombre : </b>".mysql_errno());}
//else{echo "<p><b>correcte $query</b></p>";}
		  }//fin if
/////////////////////////////////////////////////////////////////////////////////////////////////////
$query7="SELECT * FROM `ProcesVerbal`";
$result7=mysql_query($query7);
$result6=mysql_num_rows($result7);
if ($result6==0) {
$query=mysql_query( 
           
"INSERT INTO ProcesVerbal(provenanceDuPermis, date, heure, numDeRoute, commune, wilaya, typeVehicule, matricule, amende, numPermis, sanctionner)
          VALUES
		  ('POLICE NATIONALE', '2018-01-01', '8:00', '05', 'tebessa', 'tebessa', 'Golf R20', '10794-112-12', '2000', '10/11125/06.24', 1),
		  ('GENDARMERIE NATIONALE', '2018-04-22', '8:00', '05', 'tebessa', 'tebessa', 'Picanto', '05687-114-12', '2000', '13/77789/06.24', 1),
		  ('POLICE NATIONALE', '2018-02-01', '8:00', '05', 'guelma', 'guelma', 'Golf R20', '10794-112-12', '2000', '13/52431/06.24', 1),
		  ('GENDARMERIE NATIONALE', '2018-02-01', '8:00', '05', 'guelma', 'guelma', 'Picanto', '05687-114-12', '2000', '12/73235/06.24', 0),
		  ('POLICE NATIONALE', '2018-05-05', '8:00', '05', 'guelma', 'guelma', 'Golf R20', '10794-112-12', '2000', '15/96235/06.24', 0)
		  ");
		  mysql_set_charset('utf8');

if(!$query){die("<br><br>"."<b>failed to insert query: </b>".mysql_error()."<br><br>"."<b>error nombre: </b>".mysql_errno());}
//else{echo "<p><b>correcte $query</b></p>";}
		  }//fin if
/////////////////////////////////////////////////////////////////////////////////////////////////////
$query7="SELECT * FROM `RelPVInf`";
$result7=mysql_query($query7);
$result6=mysql_num_rows($result7);
if ($result6==0) {
$query=mysql_query( 
           
"INSERT INTO RelPVInf(idPV, inf)
          VALUES
		  (1, 5),
		  (1, 1),
		  (2, 2),
		  (2, 8),
		  (2, 1),
		  (3, 1),
		  (4, 3),
		  (5, 9)
		  ");
		  mysql_set_charset('utf8');

if(!$query){die("<br><br>"."<b>failed to insert query: </b>".mysql_error()."<br><br>"."<b>error nombre: </b>".mysql_errno());}
//else{echo "<p><b>correcte $query</b></p>";}
		  }//fin if
/////////////////////////////////////////////////////////////////////////////////////////////////////
$query8="SELECT * FROM `Commission`";
$result8=mysql_query($query8);
$result8=mysql_num_rows($result8);
if ($result8==0) {
$query=mysql_query( 
           
"INSERT INTO Commission(presidentCommission, rapporteur, representantTransport, representantAuto_ecole, representantenrgMine, representantPolice, representantGendarmerie, representantTravauxPublic, dateCommission, heureCommission, lieuCommission)
          VALUES
('Doughman Ilyes ', 'Asia Adjébi ', 'Dérbal Selim', 'Sélimi Marwen', 'Kerdoussi Salah ', 'Benaati Salah  ', 'Sissawi Madjid', 'Aristide Ouedragou', '2018-06-21','9:30', 'guelma'),
('djabri Waheb', 'Nécibi Amira', 'Adjabi Aymen', 'Félali Bachir', 'Sélawi Nour Elain ', 'Awissi Ahlam', 'Chawchi Warda', 'Nwawriya Assala', '2018-07-21','9:30', 'guelma')
		  ");
		  mysql_set_charset('utf8');

if(!$query){die("<br><br>"."<b>failed to insert query: </b>".mysql_error()."<br><br>"."<b>error nombre: </b>".mysql_errno());}
//else{echo "<p><b>correcte $query</b></p>";}
		  }//fin if
/////////////////////////////////////////////////////////////////////////////////////////////////////
$query8="SELECT * FROM `Sanction`";
$result8=mysql_query($query8);
$result8=mysql_num_rows($result8);
if ($result8==0) {
$query=mysql_query( 
           
"INSERT INTO Sanction(idPV, idCommission, idRecours, periode, dateFin, payement)
          VALUES
		  (1, 1, '', '', '', ''),
		  (2, 2, '', '', '', ''),
		  (3, 2, '', '', '', '')
		  ");
		  mysql_set_charset('utf8');

if(!$query){die("<br><br>"."<b>failed to insert query: </b>".mysql_error()."<br><br>"."<b>error nombre: </b>".mysql_errno());}
//else{echo "<p><b>correcte $query</b></p>";}
		  }//fin if	 
?>	


<?php
if(isset($_POST) && !empty($_POST['login'])&& !empty($_POST['pass'])){
	extract($_POST);
	$pass = sha1($pass);
	$sql = "SELECT id FROM Admin WHERE login='$login' AND pass='$pass' ";
	$req = mysql_query($sql) or die(mysql_error());
	 
	 
	 // INITIALISATION DES VARIABLES DE SESSION 
if(mysql_num_rows($req)>0){ 	 
	 $_SESSION['Auth']=array(
	 'login' => $login,
	 'pass' => $pass
	 );
	 header('Location:accueil.php');
							}// fin IF
	else {
		 header('Location:index.php#ERRconnecter');
		}	// FIN ELSE 					
}// fin IF
?>
<?php
//fermer pr la memoire:
mysql_close($connect);
?>








<!-- *** **** ****** ****** ***** ******* ****** ****** ****** * ***** *** **** *** *** * *** * *-->
<!DOCTYPE HTML>

<html>
	<head>
		<title>AppSchicksal</title>
			<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
			<meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no" />
			<link rel="stylesheet" href="assets/css/main.css" />
			<noscript><link rel="stylesheet" href="assets/css/noscript.css" /></noscript>
			<link rel="shortcut icon" type="image/x-icon" href="imag/avatar14.png" > 
<style>
#b1{
	color: rgba(243,51,54,1.00) ;}
#gr{ font-weight: bold;}
</style>

	</head>
	<body>
 

	<!-- Wrapper -->
			<div id="wrapper" style="background-color: rgba(0,0,0,0.3)">
				<!-- Header -->
                
					<header id="header">
				
                		<div class="logo">
							<span class="icon fa-diamond"></span>						</div>
						<div class="content">
							<div class="inner">
								<h1>AppSchicksal</h1>
								<p>
			                 			<font size="0"><a href="#connecter">S'authentifier</a> </font>                        </p> 
							</div>
						</div>
						<nav id="gr">
							<ul>
								<li><a href="#intro">Déscription</a></li>
								<li><a href="#about">À propos</a></li>
								<li><a href="#contact">Contacter</a></li>
								<!--<li><a href="#elements">Elements</a></li>-->
							</ul>
						</nav>
					</header>

				<!-- Main -->
					<div id="main">

						<!-- Intro -->
							<article id="intro">
								<h2 class="major" >Déscription</h2>
								<span class="image main"><img src="images/Capture2.PNG"alt="" /></span> 
								<p> <b>Appschicksal</b> est l'application de gestion des retraits permis de conduire réaliser par les deux étudiants <b>"Aboubakr Adil Ouchtati" </b>et <b>"Asma Aouaitia" </b> pour leurs projet de fin d'étude au niveau de l'université 8 mai 45 Guelma ,département d’informatique en spécialité de licence <b>d’ISIL 											(Ingénierie des Systèmes d'Information et des Logiciels) </b> PROMO  2015 {JUIN 2018}  . </p>
								<p></p>
							</article>

						

						<!-- About -->
							<article id="about">
								<h2 class="major">À propos</h2>
								<span class="image main"><img src="images/Capture.PNG" alt="" /></span>
								<p><b>Appschicksal</b> a pour but l’introduction d’une application informatique dans la gestion des permis de conduire relève du souci des responsables chargés de ce volet d’améliorer la performance de ce service,Sachant que l’usage de l’informatique leur apporte plus de simplicité et d’efficacité dans leur travail. </p>
                                <p>Les avantages souhaités se résument principalement en la rapidité d’accès aux informations se rapportant à la gestion des retraits de permis de conduire et leur partage avec la direction de la réglementation des affaire générales (DRAG).</p>
							</article>

						<!-- Contacter -->
						
							<article id="contact">
								<h2 class="major">Dévloppeurs </h2>
								<span class="image main"></span>
								<p align="center"> <img  src="images/ElOuchtati.png" alt="AbouBakr Adil Ouchtati" width="83" height="87" /><br/><b><i>Aboubakr Adil Ouchtati.</i></b><br/>23 ans.<br/>téléphone : 07123456789.<br/>Email: <a>aboubakradilouchtati@gmail.com </a> . <br/> GUELMA .
                                </p>
                               <div align="center">
                                <ul class="icons" >
									<li><a href="https://twitter.com/ElOuchtati" class="icon fa-twitter"><span class="label">Twitter</span></a></li>
									<li><a href="https://www.facebook.com/adil.ouchtati.16" class="icon fa-facebook"><span class="label">Facebook</span></a></li>
									<li><a href="https://www.instagram.com/adil_ouchtati" class="icon fa-instagram"><span class="label">Instagram</span></a></li>
									
								</ul>
                                </div>
                              
                                <p align="center"><img  src="images/assoum.png" alt="AbouBakr Adil Ouchtati" width="83" height="87" /> <br/><b><i>Asma Aouaitia.</i></b><br/>22 ans.<br/>téléphone : 07123456789.<br/>Email: <a>asmaaouaitia@gmail.com </a> .<br/> TEBESSA .
                                </p>
						<div align="center">
								<ul class="icons">
									<li><a href="#" class="icon fa-twitter"><span class="label">Twitter</span></a></li>
									<li><a href="#" class="icon fa-facebook"><span class="label">Facebook</span></a></li>
									<li><a href="#" class="icon fa-instagram"><span class="label">Instagram</span></a></li>
									
								</ul>
                                </div>
							</article>
                            
                            <!-- connecter -->
							<article id="connecter">
								<form action="" class="login100-form w3-animate-top" method="post" name ="login">
				
				
					<div class="login100-form-avatar align-center"><img  src="imag/2.png"></div>

					<span class="login100-form-title p-b-45"></span>
					



					<div class="wrap-input100 validate-input m-b-10" data-validate = "Username is required">
						<span class="focus-input100"></span>
						<span class="symbol-input100">
							<i class="fa fa-user"></i>
						</span>
                        <input class="input100" type="text" placeholder="Nom d'utilisateur" required name="login" value="ADMIN">
						
					</div>



					<div class="wrap-input100 validate-input m-b-10" data-validate = "Password is required">
                    <span class="focus-input100"></span>
						<span class="symbol-input100">
							<i class="fa fa-lock"></i>
						</span>
						<input class="input100" type="password" placeholder="Mot de passe" required name="pass">
						
					</div>

					<br/>
					<div align="center">
						<button class="txt1 login100-form-btn"><b>
							ENTRER
						</b></button>
					</div>

				</form>	
								
							</article>
<!-- erreur de connecter -->

							</article>
<article id="ERRconnecter">

								<form action="" class="login100-form w3-animate-top" method="post" name ="login">
				
				
					<div class="login100-form-avatar align-center"><img  src="imag/2.png"></div>

					<span class="login100-form-title p-b-45"></span>
					



					<div data-validate = "Username is required">
                    
                          <div align="center" >   <b id="b1" ><marquee direction="">"Le mot de passe ou le nom d'utilisateur est incorrecte..!! "</marquee></b><br/></div>
						<span class="focus-input100"></span>
						<span class="symbol-input100">
							<i class="fa fa-user"></i>
						</span>
                        <input class="input100" type="text" placeholder="Nom d'utilisateur" required name="login" value="ADMIN">
						
					</div>



					<div class="wrap-input100 validate-input m-b-10" data-validate = "Password is required">
                    <span class="focus-input100"></span>
						<span class="symbol-input100">
							<i class="fa fa-lock"></i>
						</span>
						<input class="input100" type="password" placeholder="Mot de passe" required name="pass">
						
					</div>

					<br/>
					<div align="center">
						<button ><b>
							ENTRER
						</b></button>
					</div>

				</form>	
								
							</article>
			

					</div>
                   
				<!-- Footer -->
					<footer id="footer">
                		 <b><div id="ejs_heure"  align="right">   </div></b>
					<b>	<p class="copyright" title="Ce travail a été fais par Aboubakr Adil Ochtati et Asma Aouaitia">&copy; <a href="index.php#contact"> Adil Ouchtati </a>& <a href="index.php#contact">Asma Aouaitia</a> .</p></b>
                     
					</footer>

			</div>

		<!-- BG -->
			<div id="bg"></div>

		<!-- Scripts -->
			<script src="assets/js/jquery.min.js"></script>
			<script src="assets/js/skel.min.js"></script>
			<script src="assets/js/util.js"></script>
			<script src="assets/js/main.js"></script>

	</body>
</html>

<SCRIPT LANGUAGE="JavaScript">
  // pour l'affichage de la date dynamique 
function HeureCheckEJS()
	{
	var ladate=new Date();
	// pour l'affichage du jour 
	var ladate=new Date() 
    var tab_jour=new Array("Dimanche", "Lundi", "Mardi", "Mercredi", "Jeudi", "Vendredi", "Samedi");
    var tab_mois=new Array("Janvier", "Février", "Mars", "Avril", "Mai", "Juin", "Juillet", "Août", "Septembre", "Octobre", "Novembre", "Décembre");
	krucial = new Date;
	heure = krucial.getHours();
	min = krucial.getMinutes();	
	sec = krucial.getSeconds();	
	jour = krucial.getDate();
	mois = krucial.getMonth()+1;
	annee = krucial.getFullYear();
	if (sec < 10)sec0 = "0";
	else sec0 = "";	
	if (min < 10)	min0 = "0";	
	else min0 = "";	
	if (heure < 10)	heure0 = "0";
	else heure0 = "";
	DinaHeure = heure0 + heure + ":" + min0 + min + ":" + sec0 + sec;
	DinaJour = "\"Le  "+tab_jour[ladate.getDay()]+" "+ladate.getDate()+" "+tab_mois[ladate.getMonth()] +" "+ ladate.getFullYear()+".\"" ;
    which = DinaHeure
	date = DinaJour
	if (document.getElementById){
		document.getElementById("ejs_heure").innerHTML=which+"<br/>"+date;
		
	}
	setTimeout("HeureCheckEJS()", 1000)
	}
	window.onload = HeureCheckEJS;
</SCRIPT>
